Revit 2026 API

# EnergyDataSettingsIsGlazingShaded Property

---

If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsGlazingShaded { get; set; }
```
```vb
Public Property IsGlazingShaded As Boolean
	Get
	Set
```
```cpp
public:
property bool IsGlazingShaded {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsGlazingShaded : bool with get, set
```

#### Property Value

Boolean

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace